examples_free_decay/3D_RM6_roll/mesh_3x/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nNodes  4;
cpuPN   36;

numberOfSubdomains #eval { $nNodes*$cpuPN };
method          scotch;
coeffs
{
    domains ( $nNodes $cpuPN );
    domainWeights ( 1 0.01 );
}

// ************************************************************************* //
